{
	"locale": {
		"message": "ru",
		"description": "Хак для определения текущей локали, которая отображается пользователю."
	},



	"app_name": {
		"message": "Camellia",
		"description": "Полное название расширения"
	},
	"app_description": {
		"message": "This extension lets you see your bookmarks on the page of the new tab.",
		"description": "Описание расширения. Отображается в магазинах и на странице расширений в браузере."
	},



	"new_tab": {
		"message": "New tab",
		"description": "Заголовок вкладки, устанавливаемый при её открытии."
	},
	"search": {
		"message": "Search",
		"description": "Находится в подвале слева. При нажатии на эту ссылку открывается модальное окно поиска."
	},
	"search_bookmarks": {
		"message": "Search among bookmarks",
		"description": "Заголовок модального окна поиска по закладкам."
	},
	"enter_bookmark_query": {
		"message": "Type the bookmark's title",
		"description": "Плейсхолдер, находящийся в поле ввода в модальном окне поиска по закладкам."
	},
	"manage_bookmarks": {
		"message": "Bookmark Manager",
		"description": "Находится в подвале слева. При нажатии на эту ссылку открывается встроенный в браузер менеджер закладок."
	},
	"options": {
		"message": "Options",
		"description": "Находится в подвале справа. При нажатии на эту ссылку открывается окно настроек расширения."
	},
	"help": {
		"message": "Help",
		"description": "Находится в подвале справа. При нажатии на эту ссылку открывается модальное окно помощи."
	},
	"report_bug": {
		"message": "Report a bug",
		"description": "Находится в подвале справа. При нажатии на эту ссылку происходит переход на GitHub, а точнее - на страницу с Issues."
	},
	"extensions": {
		"message": "Extensions",
		"description": "Находится в подвале справа. Открывает страницу в браузере с установленными расширениями."
	},
	"chrome_apps": {
		"message": "Apps",
		"description": "Находится в подвале справа. Открывает страницу в браузере с установленными Chrome-приложениями (chrome://apps)."
	},
	"store_page": {
		"message": "The page in the store",
		"description": "!!! DEPRECATED !!! Находится в подвале справа. При нажатии на эту ссылку происходит переход в магазин расширений на страницу этого расширения."
	},
	"close": {
		"message": "Close",
		"description": "Крестик 'Закрыть'. Данное слово подставляется для пользователей с ограниченными возможностями."
	},
	"background_loading_error_title": {
		"message": "Couldn't load the background image",
		"description": "Это уведомление показывается, когда не удается загрузить фоновую картину. Это его заголовок."
	},
	"background_loading_error_message": {
		"message": "Perhaps this picture is not available",
		"description": "Это уведомление показывается, когда не удается загрузить фоновую картину. Это его тело."
	},
	"save": {
		"message": "Save",
		"description": "Кнопка сохранения. Пока что только на странице настроек."
	},
	"error_occured": {
		"message": "An error occurred",
		"description": "Заголовок уведомления, которое появляется при возникновении ошибки."
	},
	"add_bookmarks_to_browser": {
		"message": "In order to start working with Camellia, $BOOKMARKS_MANAGER$ bookmarks to your browser",
		"description": "Это сообщение появляется вместо закладок, если их нет у пользователя.",
		"placeholders": {
			"bookmarks_manager": {
				"content": "<a href=\"chrome://bookmarks/\" class=\"underlined\">add</a>"
			}
		}
	},
	"rate_extension": {
		"message": "Rate this extension",
		"description": "Заголовок модального окна, которое появляется, если пользователь пользуется расширением более 2-х недель."
	},
	"rate_extension_description": {
		"message": "<p>You've been using Camellia for two weeks. This seems like a long time, therefore could you please rate it at the extensions store? It'll take you less than a minute but it will be huge support!</p>$RATE_BUTTON$<p>Or at least press the button there <b>G+</b> below the button \"Install\", please. But if you are being lazy, don't strain yourself. Shut this window and it will never appear again.</p>Thanks!",
		"description": "Содержимое модального окна, которое появляется, если пользователь пользуется расширением более 2-х недель.",
		"placeholders": {
			"rate_button": {
				"content": "<a class=\"btn btn-block btn-danger text-truncate mb-1\" href=\"$1\">Go to the store</a>"
			}
		}
	},


	"heading_top_sites": {
		"message": "Frequently visited sites"
	},
	"heading_closed_tabs": {
		"message": "Recently closed tabs"
	},


	"option_background_image_label": {
		"message": "The link to the background picture"
	},
	"option_background_image_hint": {
		"message": "It's better to upload the picture to some image host like Imgur. Leave this field blank for the default picture."
	},


	"option_columns_count_label": {
		"message": "The amount of columns"
	},
	"option_columns_count_hint": {
		"message": "Other amounts of columns are yet not available."
	},
	"option_columns_count_column": {
		"message": "col."
	},


	"option_use_custom_scrollbar_label": {
		"message": "Scrollbar style"
	},
	"option_use_custom_scrollbar_hint": {
		"message": "Vertical scrollbar."
	},
	"option_use_custom_scrollbar_styled": {
		"message": "Custom"
	},
	"option_use_custom_scrollbar_system": {
		"message": "System"
	},


	"option_display_click_counter_label": {
		"message": "Bookmarks clicks counter"
	},
	"option_display_click_counter_hint": {
		"message": "This option only hides/shows the counter. No matter what you choose, the clicks will still be recorded to the stat."
	},
	"option_display_click_counter_display": {
		"message": "Show"
	},
	"option_display_click_counter_hide": {
		"message": "Hide"
	},


	"option_user_select_label": {
		"message": "Text emphasizing"
	},
	"option_user_select_hint": {
		"message": "If text emphasizing annoys you, you can disable it."
	},
	"option_user_select_enabled": {
		"message": "Enabled"
	},
	"option_user_select_disabled": {
		"message": "Disabled"
	},


	"option_font_size_label": {
		"message": "Font size"
	},
	"option_font_size_hint": {
		"message": "Measured in pixels. The size of some interface elements will change along with the font size."
	},


	"option_bookmarks_in_new_tab_label": {
		"message": "How to open bookmarks"
	},
	"option_bookmarks_in_new_tab_hint": {
		"message": "Affects only bookmarks. Doesn't affect other links in the extension."
	},
	"option_bookmarks_in_new_tab_new_tab": {
		"message": "In a new tab"
	},
	"option_bookmarks_in_new_tab_current_tab": {
		"message": "In the current tab"
	},


	"option_top_sites_label": {
		"message": "Popular websites"
	},
	"option_top_sites_hint": {
		"message": "Display of popular websites that you have attended. This algorithm works inside the browser and is not connected to bookmarks. Websites that are not in the bookmarks are considered, too."
	},
	"option_top_sites_display": {
		"message": "Show"
	},
	"option_top_sites_hide": {
		"message": "Hide"
	},


	"option_recently_closed_label": {
		"message": "Last closed tabs"
	},
	"option_recently_closed_hint": {
		"message": "Last closed tabs list display."
	},
	"option_recently_closed_display": {
		"message": "Show"
	},
	"option_recently_closed_hide": {
		"message": "Hide"
	},

	"option_background_brightness_label": {
		"message": "Background brightness"
	},
	"option_background_brightness_hint": {
		"message": "Brightness below 50% is recommended for better readability."
	},

	"back_to_questions": {
		"message": "back to questions"
	},


	"help_reason_to_use_title": {
		"message": "Why would you develop Camellia when there are lots of similar extensions?"
	},
	"help_reason_to_use_answer": {
		"message": "<p>Camellia is an extension made for convenient organisation of a big amount of bookmarks. People involved in creative or professional activity often get this problem. They need to save a lot of material and it's better to keep it in the most convenient place which is browser bookmarks.</p><p>Obviously it doesn't mean that Camellia was made only for a certain group of people. If you save a lot of links that might be handy in the future, Camellia is your choice. I decided developing Camellia when I couldn't find a decent bookmarks manager in a new tab which would provide me with proper level of comfort while working with several hundreds of bookmarks.</p><p>It's important to realise that Camellia is not a \"magic wand\" that cand make a \"candy\" out of a mess. You'll have to maintain order yourself to get unforgettable experience while working with the extension, having sorted all bookmarks to folders and given them comprehensive and short names.</p>"
	},


	"help_omnibox_search_title": {
		"message": "How does one search for a bookmark using the address bar (omnibox)?"
	},
	"help_omnibox_search_answer": {
		"message": "<p>Type <code>$KEYWORD$</code>, press <kbd>Tab</kbd> or <kbd>Space</kbd>, and then start typing the name of a bookmark.</p>$GIF$<p>Unlike searching on the page of a new tab, searching via omnibox also considers the address that's linked to the bookmark, and bookmarks are also sorted by the amount of clicks.</p>",
		"placeholders": {
			"keyword": {
				"content": "$1"
			},
			"gif": {
				"content": "<img class=\"img-fluid rounded d-block mx-auto mb-1\"src=\"/img/gifs/omnibox.gif\" alt=\"An example of searching\">"
			}
		}
	},


	"help_which_browsers_supported_title": {
		"message": "Which browsers are supported?"
	},
	"help_which_browsers_supported_answer": {
		"message": "Only Google Chrome and Chromium are supported. Opera and Yandex.Browser do not support the function of changing the page of a new tab. Mozilla Firefox supports such a function but it's completely different realisation-wise, that's why porting can't be done. Safari hasn't been checked."
	},


	"help_why_permissions_title": {
		"message": "Why does it ask for access to read and write down the contents of all the websites and send notifications?"
	},
	"help_why_permissions_answer": {
		"message": "<p>The access to notifications is only needed when it's <b>necessary</b> to inform you. For example, in case of an error. Notifications won't be used for sending you unneeded information.</p><p>The access to all the links is the only way to showing the icons of the bookmarks. The browser says it doesn't have the access to the website and doesn't share the icon with Camellia. It's only used that way. Camellia doesn't read or change the info on the websites you attend, it's not interested in it.</p>"
	},


	"help_request_permissions_title": {
		"message": "Why does this extension sometimes ask for new access rights?"
	},
	"help_request_permissions_answer": {
		"message": "It's needed to implement new functions. Because of how browser extensions are treated it's needed to get access to every function even if you need just a tiny one. For example, if you need access to recently closed tabs, you need access to functions which work with the sessions."
	},


	"help_change_theme_title": {
		"message": "Is it possible to change the theme (design)?"
	},
	"help_change_theme_answer": {
		"message": "No. This functional is not yet planned but I'm open to suggestions of design improvements."
	},


	"help_screenshots_title": {
		"message": "Why there are no screenshots of bookmarked pages like in Speed Dial?"
	},
	"help_screenshots_answer": {
		"message": "The main idea of this extension is to create the most convenient workspace of a huge amount appropriately structured browser bookmarks. That's why bookmarks preview is not something that's needed for compact and minimalistic Camellia."
	},


	"help_unrelevant_wallpaper_title": {
		"message": "Why is there a calendula as the background, lotus as the logo but the extension's named Camellia?",
		"description": "!!! DEPRECATED !!!"
	},
	"help_unrelevant_wallpaper_answer": {
		"message": "This question is too good to be answered.",
		"description": "!!! DEPRECATED !!!"
	},


	"help_manage_bookmarks_title": {
		"message": "Am I able to edit, add and remove bookmarks?"
	},
	"help_manage_bookmarks_answer": {
		"message": "<p>No, it's planned to be implemented but it'll take some time. Perhaps a lot of time. You should use your browser's included solutions until then.</p><p>Bookmarks that Camellia works with are native browser bookmarks. You can work with them through the bookmarks panel under the address bar or bookmarks manager that can be opened with <kbd><kbd>Ctrl</kbd> + <kbd>Shift</kbd> + <kbd>O</kbd></kbd>.</p>"
	},


	"help_planned_features_title": {
		"message": "Where can I find out planned changes?"
	},
	"help_planned_features_answer": {
		"message": "In the repository's $URL$ at GitHub.",
		"placeholders": {
			"url": {
				"content": "<a href=\"$1\" class=\"underlined\">projects</a>"
			}
		}
	},

	"help_ctrl_f_title": {
		"message": "Why doesn't search box appear after opening a new tab and pressing <kbd><kbd>Ctrl</kbd> + <kbd>F</kbd></kbd>?"
	},
	"help_ctrl_f_answer": {
		"message": "<p>It's because the browser focuses on the address bar, not the contents of the page.</p><p>For faster searching you should use searching through the omnibox.</p>"
	},

	"help_background_author_title": {
		"message": "Who's the author of the default background picture?"
	},
	"help_background_author_answer": {
		"message": "<p>The photographer is <a href=\"https://www.pexels.com/@fatamorkidd/\" class=\"underlined\">Fatan ZW</a>. The picture was taken from <a href=\"https://www.pexels.com/photo/white-5-petaled-flower-1587575/\" class=\"underlined\">pexels.com</a>."
	}
}
