{
	"locale": {
		"message": "ru",
		"description": "Хак для определения текущей локали, которая отображается пользователю."
	},



	"app_name": {
		"message": "Camellia",
		"description": "Полное название расширения"
	},
	"app_description": {
		"message": "Описание Камелии.",
		"description": "Описание расширения. Отображается в магазинах и на странице расширений в браузере."
	},



	"new_tab": {
		"message": "Новая вкладка",
		"description": "Заголовок вкладки, устанавливаемый при её открытии."
	},
	"search": {
		"message": "Поиск",
		"description": "Находится в подвале слева. При нажатии на эту ссылку открывается модальное окно поиска."
	},
	"search_bookmarks": {
		"message": "Поиск по закладкам",
		"description": "Заголовок модального окна поиска по закладкам."
	},
	"enter_bookmark_query": {
		"message": "Введите название закладки",
		"description": "Плейсхолдер, находящийся в поле ввода в модальном окне поиска по закладкам."
	},
	"manage_bookmarks": {
		"message": "Менеджер закладок",
		"description": "Находится в подвале слева. При нажатии на эту ссылку открывается встроенный в браузер менеджер закладок."
	},
	"options": {
		"message": "Настройки",
		"description": "Находится в подвале справа. При нажатии на эту ссылку открывается окно настроек расширения."
	},
	"help": {
		"message": "Помощь",
		"description": "Находится в подвале справа. При нажатии на эту ссылку открывается модальное окно помощи."
	},
	"report_bug": {
		"message": "Сообщить о баге",
		"description": "Находится в подвале справа. При нажатии на эту ссылку происходит переход на GitHub, а точнее - на страницу с Issues."
	},
	"store_page": {
		"message": "Страница в магазине",
		"description": "!!! DEPRECATED !!! Находится в подвале справа. При нажатии на эту ссылку происходит переход в магазин расширений на страницу этого расширения."
	},
	"close": {
		"message": "Закрыть",
		"description": "Крестик 'Закрыть'. Данное слово подставляется для пользователей с ограниченными возможностями."
	},
	"background_loading_error_title": {
		"message": "Не удалось загрузить фон",
		"description": "Это уведомление показывается, когда не удается загрузить фоновую картину. Это его заголовок."
	},
	"background_loading_error_message": {
		"message": "Возможно, эта картинка больше не доступна по указанному вами адресу.",
		"description": "Это уведомление показывается, когда не удается загрузить фоновую картину. Это его тело."
	},
	"save": {
		"message": "Сохранить",
		"description": "Кнопка сохранения. Пока что только на странице настроек."
	},
	"error_occured": {
		"message": "Произошла ошибка",
		"description": "Заголовок уведомления, которое появляется при возникновении ошибки."
	},
	"add_bookmarks_to_browser": {
		"message": "Для того, чтобы начать работать с Camellia, $BOOKMARKS_MANAGER$ в ваш браузер закладки",
		"description": "Это сообщение появляется вместо закладок, если их нет у пользователя.",
		"placeholders": {
			"bookmarks_manager": {
				"content": "<a href=\"chrome://bookmarks/\" class=\"underlined\">добавьте</a>"
			}
		}
	},
	"rate_extension": {
		"message": "Оцените это расширение",
		"description": "Заголовок модального окна, которое появляется, если пользователь пользуется расширением более 2-х недель."
	},
	"rate_extension_description": {
		"message": "<p>Вы пользуетесь Камелией больше двух недель. Это кажется большим сроком, поэтому, пожалуйста, не могли бы вы оценить её в магазине расширений? У вас это займет меньше минуты, но это окажет колоссальную поддержку! </p>$RATE_BUTTON$<div>Но если лень, то не напрягайтесь. Закройте это окно и оно больше никогда не появится.</div>",
		"description": "Содержимое модального окна, которое появляется, если пользователь пользуется расширением более 2-х недель.",
		"placeholders": {
			"rate_button": {
				"content": "<a class=\"btn btn-block btn-danger text-truncate mb-1\" href=\"$1\">Перейти в магазин</a>"
			}
		}
	},





	"option_background_image_label": {
		"message": "Ссылка на фоновую картинку"
	},
	"option_background_image_hint": {
		"message": "Лучше всего загрузить картинку на какой-нибудь фото-хостинг, например, на Imgur. Оставьте поле пустым и подставится картинка по умолчанию."
	},


	"option_columns_count_label": {
		"message": "Количество колонок"
	},
	"option_columns_count_hint": {
		"message": "На данный момент другие варианты количества колонок не поддерживаются."
	},
	"option_columns_count_column": {
		"message": "кол."
	},


	"option_use_custom_scrollbar_label": {
		"message": "Стиль полосы прокрутки"
	},
	"option_use_custom_scrollbar_hint": {
		"message": "Полоса прокрутки в правой части экрана."
	},
	"option_use_custom_scrollbar_styled": {
		"message": "Стилизованный"
	},
	"option_use_custom_scrollbar_system": {
		"message": "Системный"
	},


	"option_display_click_counter_label": {
		"message": "Счетчик переходов по закладкам"
	},
	"option_display_click_counter_hint": {
		"message": "Эта настройка лишь настраивает отображение счетчика. Независимо от того, что вы выберете, счетчик все равно будет запоминать переходы в фоновом режиме."
	},
	"option_display_click_counter_display": {
		"message": "Отображать"
	},
	"option_display_click_counter_hide": {
		"message": "Скрыть"
	},


	"option_user_select_label": {
		"message": "Выделение текста"
	},
	"option_user_select_hint": {
		"message": "Если выделение текста раздражает вас, вы можете отключить его."
	},
	"option_user_select_enabled": {
		"message": "Включено"
	},
	"option_user_select_disabled": {
		"message": "Отключено"
	},


	"option_font_size_label": {
		"message": "Размер шрифта"
	},
	"option_font_size_hint": {
		"message": "Указывается в пикселях. Размер некоторых элементов интерфейса меняется вместе с размером шрифта."
	},

	"option_bookmarks_in_new_tab_label": {
		"message": "Как открывать закладки"
	},
	"option_bookmarks_in_new_tab_hint": {
		"message": "Влияет только на закладки. Не влияет на остальные ссылки в расширении."
	},
	"option_bookmarks_in_new_tab_new_tab": {
		"message": "В новой вкладке"
	},
	"option_bookmarks_in_new_tab_current_tab": {
		"message": "В текущей вкладке"
	},



	"back_to_questions": {
		"message": "назад к вопросам"
	},


	"help_reason_to_use_title": {
		"message": "Почему вы разработали Камелию, когда существует полно аналогов?"
	},
	"help_reason_to_use_answer": {
		"message": "<p>Камелия &mdash; расширение, созданное для удобной организации огромного количества закладок. С подобной проблемой часто сталкиваются люди, занимающиеся творческой или профессиональной деятельностью. Сохранять материала нужно много, и хорошо бы хранить его в самом доступном месте &mdash; в закладках браузера.</p><p>Разумеется, это не значит, что Камелия создана только для определенной группы людей. Если вы сохраняете много ссылок, которые когда-либо могут пригодиться, то Камелия &mdash; ваш выбор. Начать разработку Камелии я решил как раз после того, как не смог отыскать достойный менеджер закладок для страницы новой вкладки, который бы обеспечил мне должный уровень комфорта при работе с моими несколькими сотнями закладок.</p><p>Важно осознавать, что Камелия &mdash; это не &laquo;палочка-выручалочка&raquo;, которая может из бардака сделать &laquo;конфетку&raquo;. Для получения незабываемых ощущений при работе с расширением вам следует навести порядок самостоятельно, рассортировав все закладки по папкам и дав им понятные, не очень длинные имена.</p>"
	},


	"help_omnibox_search_title": {
		"message": "Как искать закладки через адресную строку (омнибокс) браузера?"
	},
	"help_omnibox_search_answer": {
		"message": "<p>Для этого введите <code>$KEYWORD$</code>, нажмите <kbd>Tab</kbd> или <kbd>Пробел</kbd>, а затем начните вводить название закладки.</p>$GIF$<p>В отличие от поиска на странице новой вкладки, поиск через омнибокс также учитывает адрес, который привязан к закладке, а ещё они сортируются по количеству кликов.</p>",
		"placeholders": {
			"keyword": {
				"content": "$1"
			},
			"gif": {
				"content": "<img class=\"img-fluid rounded d-block mx-auto mb-1\"src=\"/img/gifs/omnibox.gif\" alt=\"Пример поиска\">"
			}
		}
	},


	"help_which_browsers_supported_title": {
		"message": "Какие браузеры поддерживаются?"
	},
	"help_which_browsers_supported_answer": {
		"message": "Поддерживаются только Google Chrome и Chromium. Opera и Яндекс.Браузер не поддерживают функционал, позволяющий заменить страницу новой вкладки. Mozilla Firefox поддерживает подобный функционал, но реализация там совершенно другая, из-за чего портировать расширение не получится. Работа в Safari не проверялась."
	},


	"help_why_permissions_title": {
		"message": "Зачем требуется доступ к чтению и записи контента всех сайтов, а также к отправке уведомлений?"
	},
	"help_why_permissions_answer": {
		"message": "<p>Доступ к уведомлениям необходим лишь в случаях, когда вас <b>необходимо</b> уведомить. Например, о какой-нибудь ошибке. Уведомления не будут использоваться для рассылки информации, которая вам не нужна.</p><p>Доступ ко всем ссылкам &mdash; единственный способ сделать так, чтобы на странице отображались иконки закладок. Без этого доступа браузер ругается на то, что у расширения нет доступа к запрашиваемому сайту, и не делится с Камелией иконкой. Данный доступ используется исключительно в этом контексте. Камелия не читает и не изменяет данные на сайтах, которые вы посещаете &mdash; ей это не интересно.</p>"
	},


	"help_change_theme_title": {
		"message": "Можно ли изменить тему (дизайн)?"
	},
	"help_change_theme_answer": {
		"message": "Нет. На данный момент подобный функционал не запланирован, однако я открыт для идей по доработке дизайна."
	},


	"help_screenshots_title": {
		"message": "Почему нет скриншотов закладок как, например, в Speed Dial?"
	},
	"help_screenshots_answer": {
		"message": "Основная идея данного расширения &mdash; сделать удобное управление огромным количеством грамотно структурированных закладок браузера. Соответственно, идет упор на умеренный минимализм, а превью закладок &mdash; это не то, что нужно компактной и миниматистичной Камелии."
	},


	"help_unrelevant_wallpaper_title": {
		"message": "Почему на фоне стоит календула, в качестве логотипа &mdash; лотос, но при этом расширение называется Camellia?"
	},
	"help_unrelevant_wallpaper_answer": {
		"message": "Это слишком хороший вопрос, чтобы на него отвечать.",
		"description": "!!! DEPRECATED !!!"
	},


	"help_manage_bookmarks_title": {
		"message": "Я могу редактировать, добавлять и удалять закладки?"
	},
	"help_manage_bookmarks_answer": {
		"message": "<p>Нет, но такой функионал планируется добавить, однако на это потребуется какое-то время. Возможно, много времени. Пока что пользуйтесь встроенными в браузеры решениями.</p><p>Закладки, с которыми работает Камелия &mdash; это нативные браузерные закладки. Работать с ними можно как через панель закладок под адресной строкой браузера, так и через менеджер закладок, открыть который можно комбинацией клавиш <kbd><kbd>Ctrl</kbd> + <kbd>Shift</kbd> + <kbd>O</kbd></kbd>.</p>"
	},


	"help_planned_features_title": {
		"message": "Где я могу узнать список запланированных изменений?"
	},
	"help_planned_features_answer": {
		"message": "В $URL$ репозитория на GitHub.",
		"placeholders": {
			"url": {
				"content": "<a href=\"$1\" class=\"underlined\">проектах</a>"
			}
		}
	},

	"help_ctrl_f_title": {
		"message": "Почему после открытия новой вкладки и прожатия <kbd><kbd>Ctrl</kbd> + <kbd>F</kbd></kbd> не открывается окно поиска?"
	},
	"help_ctrl_f_answer": {
		"message": "<p>Дело в том, что при открытии новой вкладки фокус переведён на адресную строку браузера, а не на контент страницы, поэтому когда вы прожимаете эту комбинацию, срабатывает не событие, запрограммированное в расширении, а событие, запрограммированное в самом браузере.</p><p>Для более быстрого поиска лучше использовать поиск через омнибокс.</p>"
	}
}
